modmatic/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
#menu.debug=Debug

# dotMG (SAMD51 Cart)
# ------------------------------
dotmg_cart_samd51.name=dotMG (SAMD51 Cart)
dotmg_cart_samd51.vid.0=0x04D8
dotmg_cart_samd51.pid.0=0xEC62
dotmg_cart_samd51.build.vid=0x048D
dotmg_cart_samd51.build.pid=0xEC62
dotmg_cart_samd51.upload.tool=bossac18
dotmg_cart_samd51.upload.protocol=sam-ba
dotmg_cart_samd51.upload.maximum_size=507904
dotmg_cart_samd51.upload.offset=0x4000
dotmg_cart_samd51.upload.use_1200bps_touch=true
dotmg_cart_samd51.upload.wait_for_upload_port=true
dotmg_cart_samd51.upload.native_usb=true
dotmg_cart_samd51.build.mcu=cortex-m4
#dotmg_cart_samd51.build.f_cpu=120000000L
dotmg_cart_samd51.build.usb_product="dotMG (SAMD51 Cart)"
dotmg_cart_samd51.build.usb_manufacturer="Modmatic, LLC"
dotmg_cart_samd51.build.board=DOTMG_CART_SAMD51
dotmg_cart_samd51.build.core=arduino
dotmg_cart_samd51.build.extra_flags=-D__SAMD51G19A__ -DDOTMG_CART_SAMD51 -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -DCRYSTALLESS -mfloat-abi=hard -mfpu=fpv4-sp-d16
dotmg_cart_samd51.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dotmg_cart_samd51.build.openocdscript=openocd_scripts/arduino_zero.cfg
dotmg_cart_samd51.build.variant=dotmg_cart_samd51
dotmg_cart_samd51.build.variant_system_lib=
dotmg_cart_samd51.bootloader.tool=openocd

# TODO: bootloader
#dotmg_cart_samd51.bootloader.file=dotmg_cart_samd51/XXXX.bin

dotmg_cart_samd51.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

dotmg_cart_samd51.menu.cache.on=Enabled
dotmg_cart_samd51.menu.cache.on.build.cache_flags=-DENABLE_CACHE
dotmg_cart_samd51.menu.cache.off=Disabled
dotmg_cart_samd51.menu.cache.off.build.cache_flags=
dotmg_cart_samd51.menu.speed.120=120 MHz (standard)
dotmg_cart_samd51.menu.speed.120.build.f_cpu=120000000L
#dotmg_cart_samd51.menu.speed.150=150 MHz (overclock)
#dotmg_cart_samd51.menu.speed.150.build.f_cpu=150000000L
#dotmg_cart_samd51.menu.speed.180=180 MHz (overclock)
#dotmg_cart_samd51.menu.speed.180.build.f_cpu=180000000L
#dotmg_cart_samd51.menu.speed.200=200 MHz (overclock)
#dotmg_cart_samd51.menu.speed.200.build.f_cpu=200000000L
dotmg_cart_samd51.menu.opt.small=Small (-Os) (standard)
dotmg_cart_samd51.menu.opt.small.build.flags.optimize=-Os
#dotmg_cart_samd51.menu.opt.fast=Fast (-O2)
#dotmg_cart_samd51.menu.opt.fast.build.flags.optimize=-O2
#dotmg_cart_samd51.menu.opt.faster=Faster (-O3)
#dotmg_cart_samd51.menu.opt.faster.build.flags.optimize=-O3
#dotmg_cart_samd51.menu.opt.fastest=Fastest (-Ofast)
#dotmg_cart_samd51.menu.opt.fastest.build.flags.optimize=-Ofast
#dotmg_cart_samd51.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
#dotmg_cart_samd51.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
dotmg_cart_samd51.menu.maxqspi.50=50 MHz (standard)
dotmg_cart_samd51.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
#dotmg_cart_samd51.menu.maxqspi.fcpu=CPU Speed / 2
#dotmg_cart_samd51.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
dotmg_cart_samd51.menu.usbstack.arduino=Arduino
#dotmg_cart_samd51.menu.usbstack.tinyusb=TinyUSB
#dotmg_cart_samd51.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
#dotmg_cart_samd51.menu.debug.off=Off
#dotmg_cart_samd51.menu.debug.on=On
#dotmg_cart_samd51.menu.debug.on.build.flags.debug=-g
